Rbb666/sdk-bsp-psoc_e84-edgi-talk/libraries/HAL_Drivers/drv_lcd.c
/*
 * Copyright (c) 2006-2018, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author       Notes
 * 2025-01-06     yuanjie      first version
 */

#include <rtthread.h>
#include <board.h>

#ifdef BSP_USING_LCD

#include <rtdevice.h>
#include "cy_graphics.h"
#include "cy_axidmac.h"
#include <display_tl043wvv02.h>
#include <board.h>
#include "vg_lite.h"
#include "vg_lite_platform.h"
#ifdef PKG_USING_CPU_USAGE
    #include <cpu_usage.h>
#endif
#ifdef BSP_USING_LVGL
    #include "lv_port_disp.h"
#endif

#define DRV_DEBUG
#define LOG_TAG             "drv.lcd"
#include <drv_log.h>

/* 10.1" display pin configuration */
#define DISPLAY_RESET_PORT                  GPIO_PRT20
#define DISPLAY_RESET_PIN                   (7U)

#define LCD_WIDTH           480
#define LCD_HEIGHT          800
#define LCD_STRIDE          512
#define LCD_LAYER_X_POS_PIXELS 0
#define LCD_SCANOUT_X_ADJUST_PIXELS 0
#define LCD_LOGICAL_X_ADJUST_PIXELS 0
#define LCD_WINDOW_X_PIXELS 0
#define LCD_WINDOW_Y_PIXELS 0
#define LCD_GFXSS_ROTATE_180 0
#ifndef BSP_LCD_ROTATION_DEGREES
#define BSP_LCD_ROTATION_DEGREES 0
#endif
#define LCD_ROTATION_DEGREES BSP_LCD_ROTATION_DEGREES
#if defined(BSP_LCD_ROTATION_BACKEND_VGLITE) || \
    (BSP_LCD_ROTATION_DEGREES == 90) || (BSP_LCD_ROTATION_DEGREES == 270)
#define LCD_ROTATION_BACKEND_VGLITE 1
#else
#define LCD_ROTATION_BACKEND_VGLITE 0
#endif
#if defined(BSP_USING_LVGL) || LCD_ROTATION_BACKEND_VGLITE || \
    (defined(BSP_USING_SDLPAL) && defined(BSP_LCD_VGLITE_INDEXED))
#define LCD_VGLITE_REQUIRED 1
#else
#define LCD_VGLITE_REQUIRED 0
#endif
#define LCD_MIPI_HFP_PIXELS 86
#define LCD_MIPI_HBP_PIXELS 87
#define LCD_MIPI_HSYNC_WIDTH_PIXELS 2
#define LCD_MIPI_VFP_LINES 182
#define LCD_MIPI_VBP_LINES 8
#define LCD_MIPI_VSYNC_LINES 2
#define LCD_MIPI_PIXEL_CLOCK_KHZ 33984
#define LCD_MIPI_PER_LANE_MBPS 900
#define LCD_MIPI_MAX_PHY_CLK_HZ 2500000000UL
#define LCD_BITS_PER_PIXEL  16
#define LCD_VISIBLE_X_OFFSET_PIXELS 0
#define LCD_VISIBLE_X_OFFSET_BYTES (LCD_VISIBLE_X_OFFSET_PIXELS * LCD_BITS_PER_PIXEL / 8)
#define LCD_PIXEL_FORMAT    RTGRAPHIC_PIXEL_FORMAT_RGB565
#define LCD_DEVICE(dev)     (struct drv_lcd_device*)(dev)
#define LCD_BL_PWM_DEV_NAME      "pwm18"
#define LCD_BL_PWM_CHANNEL       0
#define LCD_BL_PWM_PERIOD_NS     200000
#define LCD_BL_DEFAULT_BRIGHTNESS 80
#define LCD_AXIDMAC_CHANNEL      0U
#define LCD_AXIDMAC_TIMEOUT_MS   20U
#define LCD_AXIDMAC_ERROR_MASK   (CY_AXIDMAC_INTR_SRC_BUS_ERROR | \
                                  CY_AXIDMAC_INTR_DST_BUS_ERROR | \
                                  CY_AXIDMAC_INTR_INVALID_DESCR_TYPE | \
                                  CY_AXIDMAC_INTR_CURR_PTR_NULL | \
                                  CY_AXIDMAC_INTR_ACTIVE_CH_DISABLED | \
                                  CY_AXIDMAC_INTR_DESCR_BUS_ERROR)

#ifndef LCD_AXIDMAC_AREA_COPY_MIN_BYTES
#ifdef BSP_LCD_AXIDMAC_AREA_COPY_MIN_BYTES
#define LCD_AXIDMAC_AREA_COPY_MIN_BYTES BSP_LCD_AXIDMAC_AREA_COPY_MIN_BYTES
#else
#define LCD_AXIDMAC_AREA_COPY_MIN_BYTES (8U * 1024U)
#endif
#endif

#ifndef LCD_USE_AXIDMAC_AREA_COPY
#ifdef BSP_LCD_USE_AXIDMAC_AREA_COPY
#define LCD_USE_AXIDMAC_AREA_COPY 1
#else
#define LCD_USE_AXIDMAC_AREA_COPY 0
#endif
#endif

#if ((LCD_ROTATION_DEGREES != 0) && (LCD_ROTATION_DEGREES != 90) && \
     (LCD_ROTATION_DEGREES != 180) && (LCD_ROTATION_DEGREES != 270))
#error "LCD_ROTATION_DEGREES must be 0, 90, 180, or 270"
#endif

#if ((LCD_ROTATION_BACKEND_VGLITE != 0) && \
     (LCD_ROTATION_DEGREES != 90) && (LCD_ROTATION_DEGREES != 270))
#error "LCD_ROTATION_BACKEND_VGLITE requires LCD_ROTATION_DEGREES to be 90 or 270"
#endif

#if ((LCD_ROTATION_DEGREES == 90) || (LCD_ROTATION_DEGREES == 270))
#define LCD_LOGICAL_WIDTH   LCD_HEIGHT
#define LCD_LOGICAL_HEIGHT  LCD_WIDTH
#define LCD_RENDER_STRIDE   LCD_LOGICAL_WIDTH
#else
#define LCD_LOGICAL_WIDTH   LCD_WIDTH
#define LCD_LOGICAL_HEIGHT  LCD_HEIGHT
#define LCD_RENDER_STRIDE   LCD_STRIDE
#endif

#define LCD_RENDER_BUF_SIZE  (LCD_RENDER_STRIDE * LCD_LOGICAL_HEIGHT * LCD_BITS_PER_PIXEL / 8)
#define LCD_SCANOUT_BUF_SIZE (LCD_STRIDE * LCD_HEIGHT * LCD_BITS_PER_PIXEL / 8)
#define LCD_BUF_SIZE         LCD_SCANOUT_BUF_SIZE

#if LCD_ROTATION_BACKEND_VGLITE
#define LCD_NEEDS_SCANOUT_BUFFER 1
#else
#define LCD_NEEDS_SCANOUT_BUFFER 0
#endif

#if (LCD_SCANOUT_X_ADJUST_PIXELS >= LCD_WIDTH)
#error "LCD_SCANOUT_X_ADJUST_PIXELS must be smaller than LCD_WIDTH"
#endif

#define GPU_TESSELLATION_BUFFER_SIZE        ((LCD_LOGICAL_WIDTH) * 128U)
#define APP_BUFFER_COUNT                    (2U)
#define DEFAULT_GPU_CMD_BUFFER_SIZE         ((64U) * (512))
#define VG_PARAMS_POS                       (0UL)
#define GPU_MEM_BASE                        (0x0U)
#define VGLITE_HEAP_SIZE        (((DEFAULT_GPU_CMD_BUFFER_SIZE) * \
                                 (APP_BUFFER_COUNT)) + \
                                 ((GPU_TESSELLATION_BUFFER_SIZE) * \
                                 (APP_BUFFER_COUNT)))
#if defined(BSP_USING_SDLPAL) && defined(BSP_LCD_VGLITE_INDEXED)
#define LCD_INDEXED_WIDTH        320U
#define LCD_INDEXED_HEIGHT       200U
#define LCD_INDEXED_STRIDE       LCD_INDEXED_WIDTH
#define LCD_INDEXED_BUFFER_SIZE  (LCD_INDEXED_STRIDE * LCD_INDEXED_HEIGHT)
#endif
CY_SECTION(".cy_gpu_buf") CY_ALIGN(__SCB_DCACHE_LINE_SIZE) uint8_t contiguous_mem[VGLITE_HEAP_SIZE] = { 0xFF };
volatile void *vglite_heap_base = &contiguous_mem;

struct drv_lcd_device _lcd;

GFXSS_Type *gfxbase = (GFXSS_Type*) GFXSS;
static cy_stc_gfx_context_t lcd_gfx_context;

CY_SECTION(".cy_gpu_buf") CY_ALIGN(__SCB_DCACHE_LINE_SIZE) static uint8_t graphics_storage[LCD_RENDER_BUF_SIZE + LCD_VISIBLE_X_OFFSET_BYTES] = {0xFF};
static uint8_t *graphics_buffer = &graphics_storage[LCD_VISIBLE_X_OFFSET_BYTES];

#if LCD_NEEDS_SCANOUT_BUFFER
CY_SECTION(".cy_gpu_buf") CY_ALIGN(__SCB_DCACHE_LINE_SIZE) static uint8_t graphics_scanout_storage[LCD_SCANOUT_BUF_SIZE] = {0x00};
#endif

#if defined(BSP_USING_SDLPAL) && defined(BSP_LCD_VGLITE_INDEXED)
CY_SECTION(".cy_gpu_buf.sdlpal_indexed") CY_ALIGN(__SCB_DCACHE_LINE_SIZE)
static uint8_t graphics_indexed_storage[LCD_INDEXED_BUFFER_SIZE];
#endif

#if LCD_USE_AXIDMAC_AREA_COPY
CY_SECTION(".cy_socmem_data") CY_ALIGN(8) static cy_stc_axidmac_descriptor_t lcd_axidmac_descriptor;
static rt_mutex_t lcd_axidmac_lock;
#endif

