Rbb666/sdk-bsp-psoc_e84-edgi-talk/libraries/HAL_Drivers/drv_lcd.c
static inline uint16_t *lcd_render_framebuffer(void)
{
    return (uint16_t *)graphics_buffer;
}

static inline uint32_t *lcd_scanout_framebuffer(void)
{
#if LCD_NEEDS_SCANOUT_BUFFER
    return (uint32_t *)graphics_scanout_storage;
#else
    return (uint32_t *)&graphics_storage[0];
#endif
}

static void lcd_apply_gfxss_rotation(void)
{
#if vivENABLE_LAYER_ROT
    static rt_bool_t rotation_log_done = RT_FALSE;
    gctUINT rotation_cap = 0U;
    vivSTATUS cap_status;
#if LCD_GFXSS_ROTATE_180
    vivSTATUS select_status;
    vivSTATUS rotation_status;
    vivSTATUS commit_status;
#endif

    cap_status = viv_layer_query_capability(GFX_LAYER_GRAPHICS, vivLAYER_CAP_ROTATION, &rotation_cap);

#if LCD_GFXSS_ROTATE_180
    if ((cap_status == vivSTATUS_OK) && (rotation_cap != 0U))
    {
        select_status = viv_dc_select_layer(GFX_LAYER_GRAPHICS);
        rotation_status = viv_layer_rotation(vivROTANGLE_180);
        commit_status = viv_set_commit(0x1);
    }
    else
    {
        select_status = vivSTATUS_NOT_SUPPORT;
        rotation_status = vivSTATUS_NOT_SUPPORT;
        commit_status = vivSTATUS_NOT_SUPPORT;
    }

    if (!rotation_log_done)
    {
        if ((select_status != vivSTATUS_OK) ||
            (rotation_status != vivSTATUS_OK) ||
            (commit_status != vivSTATUS_OK))
        {
            LOG_W("GFXSS layer rotation config failed: cap=%d/%u select=%d rotation=%d commit=%d",
                  cap_status, rotation_cap, select_status, rotation_status, commit_status);
        }
        else
        {
            LOG_I("GFXSS layer rotation: %d degrees, cap=%d/%u",
                  LCD_GFXSS_ROTATE_180 ? 180 : 0, cap_status, rotation_cap);
        }
        rotation_log_done = RT_TRUE;
    }
#else
    if (!rotation_log_done)
    {
        LOG_I("GFXSS layer rotation disabled, cap=%d/%u", cap_status, rotation_cap);
        rotation_log_done = RT_TRUE;
    }
#endif
#endif
}

static void lcd_apply_runtime_gfxss_config(void)
{
    GFXSS_graphics_layer.layer_type = GFX_LAYER_GRAPHICS;
    GFXSS_graphics_layer.input_format_type = vivRGB565;
    GFXSS_graphics_layer.tiling_type = vivLINEAR;
    GFXSS_graphics_layer.pos_x = LCD_LAYER_X_POS_PIXELS;
    GFXSS_graphics_layer.pos_y = 0;
    GFXSS_graphics_layer.width = LCD_WIDTH;
    GFXSS_graphics_layer.height = LCD_HEIGHT;
    GFXSS_graphics_layer.zorder = 0;
    GFXSS_graphics_layer.layer_enable = true;
    GFXSS_graphics_layer.visibility = true;

    GFXSS_overlay0_layer.layer_enable = false;
    GFXSS_overlay0_layer.visibility = false;
    GFXSS_overlay0_layer.width = 1;
    GFXSS_overlay0_layer.height = 1;
    GFXSS_overlay1_layer.layer_enable = false;
    GFXSS_overlay1_layer.visibility = false;
    GFXSS_overlay1_layer.width = 1;
    GFXSS_overlay1_layer.height = 1;

    GFXSS_dc_config.gfx_layer_config = &GFXSS_graphics_layer;
    GFXSS_dc_config.ovl0_layer_config = &GFXSS_overlay0_layer;
    GFXSS_dc_config.ovl1_layer_config = &GFXSS_overlay1_layer;
    GFXSS_dc_config.display_type = GFX_DISP_TYPE_DSI_DPI;
    /* Device Configurator does not expose CFG1, but this panel wiring needs it. */
    GFXSS_dc_config.display_format = vivD16CFG1;
    GFXSS_dc_config.display_size = vivDISPLAY_CUSTOMIZED;
    GFXSS_dc_config.display_width = LCD_WIDTH;
    GFXSS_dc_config.display_height = LCD_HEIGHT;

    GFXSS_mipidsi_display_params.pixel_clock = LCD_MIPI_PIXEL_CLOCK_KHZ;
    GFXSS_mipidsi_display_params.hdisplay = LCD_WIDTH;
    GFXSS_mipidsi_display_params.hsync_width = LCD_MIPI_HSYNC_WIDTH_PIXELS;
    GFXSS_mipidsi_display_params.hfp = LCD_MIPI_HFP_PIXELS;
    GFXSS_mipidsi_display_params.hbp = LCD_MIPI_HBP_PIXELS;
    GFXSS_mipidsi_display_params.vdisplay = LCD_HEIGHT;
    GFXSS_mipidsi_display_params.vsync_width = LCD_MIPI_VSYNC_LINES;
    GFXSS_mipidsi_display_params.vfp = LCD_MIPI_VFP_LINES;
    GFXSS_mipidsi_display_params.vbp = LCD_MIPI_VBP_LINES;
    GFXSS_mipidsi_display_params.polarity_flags = 0;

    GFXSS_mipi_dsi_config.virtual_ch = 0;
    GFXSS_mipi_dsi_config.num_of_lanes = MTB_DISPLAY_EK79007AD3_PANEL_NUM_LANES;
    GFXSS_mipi_dsi_config.per_lane_mbps = LCD_MIPI_PER_LANE_MBPS;
    GFXSS_mipi_dsi_config.dpi_fmt = CY_MIPIDSI_FMT_RGB565;
    GFXSS_mipi_dsi_config.dsi_mode = DSI_VIDEO_MODE;
    GFXSS_mipi_dsi_config.max_phy_clk = LCD_MIPI_MAX_PHY_CLK_HZ;
    GFXSS_mipi_dsi_config.mode_flags =
        VID_MODE_TYPE_NON_BURST_SYNC_PULSES | ENABLE_LOW_POWER_CMD | ENABLE_LOW_POWER;
    GFXSS_mipi_dsi_config.display_params = &GFXSS_mipidsi_display_params;

    GFXSS_config.dc_cfg = &GFXSS_dc_config;
    GFXSS_config.gpu_cfg = &GFXSS_gpu_config;
    GFXSS_config.mipi_dsi_cfg = &GFXSS_mipi_dsi_config;
}

#if LCD_VGLITE_REQUIRED
static rt_err_t lcd_vglite_init_once(void);

#if LCD_NEEDS_SCANOUT_BUFFER || \
    (defined(BSP_USING_SDLPAL) && defined(BSP_LCD_VGLITE_INDEXED))
static void lcd_vglite_buffer_init(vg_lite_buffer_t *buffer, void *memory,
                                   uint32_t width, uint32_t height, uint32_t stride_pixels)
{
    memset(buffer, 0, sizeof(*buffer));
    buffer->width = width;
    buffer->height = height;
    buffer->stride = stride_pixels * (LCD_BITS_PER_PIXEL / 8);
#ifdef BSP_USING_SDLPAL
    buffer->format = VG_LITE_BGR565;
#else
    buffer->format = VG_LITE_RGB565;
#endif
    buffer->tiled = VG_LITE_LINEAR;
    buffer->image_mode = VG_LITE_NORMAL_IMAGE_MODE;
    buffer->transparency_mode = VG_LITE_IMAGE_OPAQUE;
    buffer->memory = memory;
    buffer->address = (uint32_t)(uintptr_t)memory;
}

#if LCD_NEEDS_SCANOUT_BUFFER
static vg_lite_error_t lcd_vglite_build_rotation_matrix(vg_lite_matrix_t *matrix,
                                                        uint32_t src_width,
                                                        uint32_t src_height)
{
    vg_lite_float_point4_t src;
    vg_lite_float_point4_t dst;
    const vg_lite_float_t logical_x_adjust = (vg_lite_float_t)LCD_LOGICAL_X_ADJUST_PIXELS;

    src[0].x = 0.0f;
    src[0].y = 0.0f;
    src[1].x = (vg_lite_float_t)src_width;
    src[1].y = 0.0f;
    src[2].x = (vg_lite_float_t)src_width;
    src[2].y = (vg_lite_float_t)src_height;
    src[3].x = 0.0f;
    src[3].y = (vg_lite_float_t)src_height;

#if LCD_ROTATION_DEGREES == 90
    dst[0].x = (vg_lite_float_t)LCD_WIDTH;
    dst[0].y = logical_x_adjust;
    dst[1].x = (vg_lite_float_t)LCD_WIDTH;
    dst[1].y = (vg_lite_float_t)LCD_HEIGHT + logical_x_adjust;
    dst[2].x = 0.0f;
    dst[2].y = (vg_lite_float_t)LCD_HEIGHT + logical_x_adjust;
    dst[3].x = 0.0f;
    dst[3].y = logical_x_adjust;
#elif LCD_ROTATION_DEGREES == 180
    dst[0].x = (vg_lite_float_t)LCD_WIDTH;
    dst[0].y = (vg_lite_float_t)LCD_HEIGHT;
    dst[1].x = 0.0f;
    dst[1].y = (vg_lite_float_t)LCD_HEIGHT;
    dst[2].x = 0.0f;
    dst[2].y = 0.0f;
    dst[3].x = (vg_lite_float_t)LCD_WIDTH;
    dst[3].y = 0.0f;
#elif LCD_ROTATION_DEGREES == 270
    dst[0].x = 0.0f;
    dst[0].y = (vg_lite_float_t)LCD_HEIGHT - logical_x_adjust;
    dst[1].x = 0.0f;
    dst[1].y = -logical_x_adjust;
    dst[2].x = (vg_lite_float_t)LCD_WIDTH;
    dst[2].y = -logical_x_adjust;
    dst[3].x = (vg_lite_float_t)LCD_WIDTH;
    dst[3].y = (vg_lite_float_t)LCD_HEIGHT - logical_x_adjust;
#else
    dst[0].x = 0.0f;
    dst[0].y = 0.0f;
    dst[1].x = (vg_lite_float_t)LCD_WIDTH;
    dst[1].y = 0.0f;
    dst[2].x = (vg_lite_float_t)LCD_WIDTH;
    dst[2].y = (vg_lite_float_t)LCD_HEIGHT;
    dst[3].x = 0.0f;
    dst[3].y = (vg_lite_float_t)LCD_HEIGHT;
#endif

