Rbb666/sdk-bsp-psoc_e84-edgi-talk/libraries/HAL_Drivers/drv_lcd.c
    vg_lite_identity(matrix);
    return vg_lite_get_transform_matrix(src, dst, matrix);
}

static rt_bool_t lcd_vglite_rotate_to_scanout(const void *source_pixels,
                                              uint32_t source_width,
                                              uint32_t source_height,
                                              uint32_t source_stride)
{
    static rt_bool_t error_logged = RT_FALSE;
    vg_lite_buffer_t src;
    vg_lite_buffer_t dst;
    vg_lite_matrix_t matrix;
    vg_lite_error_t vg_status;

    lcd_vglite_buffer_init(&src, (void *)source_pixels,
                           source_width, source_height, source_stride);
    lcd_vglite_buffer_init(&dst, (void *)lcd_scanout_framebuffer(),
                           LCD_WIDTH, LCD_HEIGHT, LCD_STRIDE);

    vg_status = lcd_vglite_build_rotation_matrix(&matrix, source_width, source_height);
    if (vg_status != VG_LITE_SUCCESS)
    {
        if (!error_logged)
        {
            LOG_W("VG-Lite rotate matrix failed: %d", vg_status);
            error_logged = RT_TRUE;
        }
        return RT_FALSE;
    }

#if ((LCD_SCANOUT_X_ADJUST_PIXELS != 0) || (LCD_LOGICAL_X_ADJUST_PIXELS != 0))
    vg_status = vg_lite_clear(&dst, NULL, 0x00000000U);
    if (vg_status != VG_LITE_SUCCESS)
    {
        if (!error_logged)
        {
            LOG_W("VG-Lite clear failed: %d", vg_status);
            error_logged = RT_TRUE;
        }
        return RT_FALSE;
    }
#endif

    vg_status = vg_lite_blit(&dst, &src, &matrix, VG_LITE_BLEND_NONE, 0U, VG_LITE_FILTER_POINT);
    if (vg_status == VG_LITE_SUCCESS)
    {
        vg_status = vg_lite_finish();
    }

    if (vg_status != VG_LITE_SUCCESS)
    {
        if (!error_logged)
        {
            LOG_W("VG-Lite rotate %d failed: %d", LCD_ROTATION_DEGREES, vg_status);
            error_logged = RT_TRUE;
        }
        return RT_FALSE;
    }

    return RT_TRUE;
}
#endif
#endif
#endif

static void lcd_dcache_clean_range(const void *addr, uint32_t size)
{
    uintptr_t start = (uintptr_t)addr & ~((uintptr_t)__SCB_DCACHE_LINE_SIZE - 1U);
    uintptr_t end = ((uintptr_t)addr + size + __SCB_DCACHE_LINE_SIZE - 1U) &
                    ~((uintptr_t)__SCB_DCACHE_LINE_SIZE - 1U);

    if (size != 0U)
    {
        SCB_CleanDCache_by_Addr((void *)start, (int32_t)(end - start));
    }
}

static void lcd_dcache_invalidate_range(void *addr, uint32_t size)
{
    uintptr_t start = (uintptr_t)addr & ~((uintptr_t)__SCB_DCACHE_LINE_SIZE - 1U);
    uintptr_t end = ((uintptr_t)addr + size + __SCB_DCACHE_LINE_SIZE - 1U) &
                    ~((uintptr_t)__SCB_DCACHE_LINE_SIZE - 1U);

    if (size != 0U)
    {
        SCB_InvalidateDCache_by_Addr((void *)start, (int32_t)(end - start));
    }
}

#if LCD_USE_AXIDMAC_AREA_COPY
static rt_bool_t lcd_axidmac_copy_rgb565_area(const uint16_t *src_pixels,
                                              uint32_t src_stride,
                                              uint32_t dst_x,
                                              uint32_t dst_y,
                                              uint32_t width,
                                              uint32_t height)
{
    const uint32_t row_bytes = width * sizeof(uint16_t);
    const uint32_t total_bytes = row_bytes * height;
    const int32_t src_x_incr = (int32_t)(src_stride * sizeof(uint16_t));
    const int32_t dst_x_incr = (int32_t)(LCD_RENDER_STRIDE * sizeof(uint16_t));
    uint16_t *dst_pixels = lcd_render_framebuffer() + (dst_y * LCD_RENDER_STRIDE) + dst_x;
    uint32_t deadline;
    uint32_t intr;

    if ((src_pixels == RT_NULL) || (width == 0U) || (height == 0U))
    {
        return RT_FALSE;
    }

    if ((total_bytes < LCD_AXIDMAC_AREA_COPY_MIN_BYTES) ||
        (row_bytes > CY_AXIDMAC_LOOP_COUNT_MAX) ||
        (height > CY_AXIDMAC_LOOP_COUNT_MAX) ||
        (src_x_incr > CY_AXIDMAC_LOOP_INCREMENT_MAX) ||
        (dst_x_incr > CY_AXIDMAC_LOOP_INCREMENT_MAX))
    {
        return RT_FALSE;
    }

    if ((lcd_axidmac_lock != RT_NULL) &&
        (rt_mutex_take(lcd_axidmac_lock,
                       rt_tick_from_millisecond(LCD_AXIDMAC_TIMEOUT_MS)) != RT_EOK))
    {
        return RT_FALSE;
    }

    {
        cy_stc_axidmac_descriptor_config_t descriptor_config =
        {
            .retrigger = CY_AXIDMAC_RETRIG_IM,
            .interruptType = CY_AXIDMAC_DESCR,
            .triggerOutType = CY_AXIDMAC_DESCR,
            .channelState = CY_AXIDMAC_CHANNEL_DISABLED,
            .triggerInType = CY_AXIDMAC_DESCR,
            .dataPrefetch = true,
            .descriptorType = CY_AXIDMAC_2D_MEMORY_COPY,
            .srcAddress = (void *)src_pixels,
            .dstAddress = (void *)dst_pixels,
            .mCount = row_bytes,
            .srcXincrement = (int16_t)src_x_incr,
            .dstXincrement = (int16_t)dst_x_incr,
            .xCount = height,
            .srcYincrement = 0,
            .dstYincrement = 0,
            .yCount = 1U,
            .nextDescriptor = RT_NULL,
        };
        cy_stc_axidmac_channel_config_t channel_config =
        {
            .descriptor = &lcd_axidmac_descriptor,
            .priority = 2U,
            .enable = false,
            .bufferable = true,
        };

        Cy_AXIDMAC_Channel_Disable(SAXI_DMAC, LCD_AXIDMAC_CHANNEL);
        Cy_AXIDMAC_Channel_ClearInterrupt(SAXI_DMAC, LCD_AXIDMAC_CHANNEL, CY_AXIDMAC_INTR_MASK);

        if ((Cy_AXIDMAC_Descriptor_Init(&lcd_axidmac_descriptor, &descriptor_config) != CY_AXIDMAC_SUCCESS) ||
            (Cy_AXIDMAC_Channel_Init(SAXI_DMAC, LCD_AXIDMAC_CHANNEL, &channel_config) != CY_AXIDMAC_SUCCESS))
        {
            if (lcd_axidmac_lock != RT_NULL)
            {
                rt_mutex_release(lcd_axidmac_lock);
            }
            return RT_FALSE;
        }
    }

    lcd_dcache_clean_range(src_pixels, ((height - 1U) * src_stride * sizeof(uint16_t)) + row_bytes);
    lcd_dcache_clean_range(dst_pixels, ((height - 1U) * LCD_RENDER_STRIDE * sizeof(uint16_t)) + row_bytes);
    lcd_dcache_clean_range(&lcd_axidmac_descriptor, sizeof(lcd_axidmac_descriptor));

    Cy_AXIDMAC_Enable(SAXI_DMAC);
    Cy_AXIDMAC_Channel_Enable(SAXI_DMAC, LCD_AXIDMAC_CHANNEL);
    Cy_AXIDMAC_Channel_SetSwTrigger(SAXI_DMAC, LCD_AXIDMAC_CHANNEL);

    deadline = rt_tick_get() + rt_tick_from_millisecond(LCD_AXIDMAC_TIMEOUT_MS);
    do
    {
        intr = Cy_AXIDMAC_Channel_GetInterruptStatus(SAXI_DMAC, LCD_AXIDMAC_CHANNEL);
        if ((intr & LCD_AXIDMAC_ERROR_MASK) != 0U)
        {
            Cy_AXIDMAC_Channel_ClearInterrupt(SAXI_DMAC, LCD_AXIDMAC_CHANNEL, intr);
            Cy_AXIDMAC_Channel_Disable(SAXI_DMAC, LCD_AXIDMAC_CHANNEL);
            if (lcd_axidmac_lock != RT_NULL)
            {
                rt_mutex_release(lcd_axidmac_lock);
            }
            return RT_FALSE;
        }

        if ((intr & CY_AXIDMAC_INTR_COMPLETION) != 0U)
        {
            Cy_AXIDMAC_Channel_ClearInterrupt(SAXI_DMAC, LCD_AXIDMAC_CHANNEL, intr);
            lcd_dcache_invalidate_range(dst_pixels,
                                        ((height - 1U) * LCD_RENDER_STRIDE * sizeof(uint16_t)) + row_bytes);
            if (lcd_axidmac_lock != RT_NULL)
            {
                rt_mutex_release(lcd_axidmac_lock);
            }
            return RT_TRUE;
        }
    } while ((int32_t)(deadline - rt_tick_get()) > 0);

    Cy_AXIDMAC_Channel_Disable(SAXI_DMAC, LCD_AXIDMAC_CHANNEL);
    if (lcd_axidmac_lock != RT_NULL)
    {
        rt_mutex_release(lcd_axidmac_lock);
    }
    return RT_FALSE;
}
#endif

