Rbb666/sdk-bsp-psoc_e84-edgi-talk/libraries/HAL_Drivers/drv_lcd.c
static void lcd_wait_present_done(void);

static void lcd_present_framebuffer(void)
{
    volatile cy_en_gfx_status_t status;

    lcd_dcache_clean_range(lcd_render_framebuffer(), LCD_RENDER_BUF_SIZE);
#if LCD_ROTATION_BACKEND_VGLITE
    lcd_dcache_invalidate_range(lcd_scanout_framebuffer(), LCD_SCANOUT_BUF_SIZE);
    if (!lcd_vglite_rotate_to_scanout(lcd_render_framebuffer(),
                                      LCD_LOGICAL_WIDTH,
                                      LCD_LOGICAL_HEIGHT,
                                      LCD_RENDER_STRIDE))
    {
        return;
    }
    lcd_dcache_invalidate_range(lcd_scanout_framebuffer(), LCD_SCANOUT_BUF_SIZE);
#else
    lcd_dcache_clean_range(lcd_scanout_framebuffer(), LCD_SCANOUT_BUF_SIZE);
#endif
    gfxbase->GFXSS_DC.DCNANO.GCREGFRAMEBUFFERSTRIDE = LCD_STRIDE * (LCD_BITS_PER_PIXEL / 8);
    status = Cy_GFXSS_Set_FrameBuffer(gfxbase, lcd_scanout_framebuffer(), &lcd_gfx_context);
    if (CY_GFX_SUCCESS != status)
    {
        LOG_E("[%s: %d] Image rendering failed. Error type: %u\r\n", __func__, __LINE__, status);
        CY_ASSERT(0);
    }
    lcd_apply_gfxss_rotation();
    lcd_wait_present_done();
}

void lcd_flush_rgb565(const void *pixels, uint32_t width, uint32_t height)
{
    const uint16_t *src = (const uint16_t *)pixels;
    uint16_t *dst = lcd_render_framebuffer();
    const uint32_t dst_x0 = LCD_WINDOW_X_PIXELS;
    const uint32_t dst_y0 = LCD_WINDOW_Y_PIXELS;

    if ((src == RT_NULL) || (width == 0U) || (height == 0U))
    {
        return;
    }

    if ((dst_x0 >= LCD_LOGICAL_WIDTH) || (dst_y0 >= LCD_LOGICAL_HEIGHT))
    {
        return;
    }

    memset(dst, 0, LCD_RENDER_BUF_SIZE);

    {
        uint32_t copy_width = (width > (LCD_LOGICAL_WIDTH - dst_x0)) ?
                              (LCD_LOGICAL_WIDTH - dst_x0) : width;
        uint32_t copy_height = (height > (LCD_LOGICAL_HEIGHT - dst_y0)) ?
                               (LCD_LOGICAL_HEIGHT - dst_y0) : height;

        for (uint32_t row = 0; row < copy_height; row++)
        {
            uint16_t *dst_row = dst + ((dst_y0 + row) * LCD_RENDER_STRIDE);
            const uint16_t *src_row = src + (row * width);

            memcpy(dst_row + dst_x0, src_row, copy_width * sizeof(uint16_t));
        }
    }

    lcd_present_framebuffer();
}

void lcd_flush_rgb565_area(const void *pixels, uint32_t x, uint32_t y,
                           uint32_t width, uint32_t height, uint32_t src_stride,
                           rt_bool_t present)
{
    const uint16_t *src = (const uint16_t *)pixels;
    uint16_t *dst = lcd_render_framebuffer();
    uint32_t dst_x0 = LCD_WINDOW_X_PIXELS + x;
    uint32_t dst_y0 = LCD_WINDOW_Y_PIXELS + y;
    uint32_t copy_width = width;
    uint32_t copy_height = height;

    if ((src == RT_NULL) || (width == 0U) || (height == 0U) || (src_stride == 0U))
    {
        return;
    }

    if (src_stride < width)
    {
        return;
    }

    if ((dst_x0 >= LCD_LOGICAL_WIDTH) || (dst_y0 >= LCD_LOGICAL_HEIGHT))
    {
        return;
    }

    if ((dst_x0 + copy_width) > LCD_LOGICAL_WIDTH)
    {
        copy_width = LCD_LOGICAL_WIDTH - dst_x0;
    }

    if ((dst_y0 + copy_height) > LCD_LOGICAL_HEIGHT)
    {
        copy_height = LCD_LOGICAL_HEIGHT - dst_y0;
    }

#if LCD_USE_AXIDMAC_AREA_COPY
    if (!lcd_axidmac_copy_rgb565_area(src, src_stride, dst_x0, dst_y0, copy_width, copy_height))
#endif
    {
        for (uint32_t row = 0; row < copy_height; row++)
        {
            uint16_t *dst_row = dst + ((dst_y0 + row) * LCD_RENDER_STRIDE);
            const uint16_t *src_row = src + (row * src_stride);

            memcpy(dst_row + dst_x0, src_row, copy_width * sizeof(uint16_t));
        }
    }

    if (present)
    {
        lcd_present_framebuffer();
    }
}

#if defined(BSP_USING_SDLPAL) && defined(BSP_LCD_VGLITE_INDEXED)
static rt_bool_t lcd_indexed_vglite_failed(const char *stage,
                                           vg_lite_error_t status)
{
    static rt_bool_t error_logged = RT_FALSE;

    if (!error_logged)
    {
        LOG_W("VG-Lite indexed %s failed: %d", stage, status);
        error_logged = RT_TRUE;
    }
    return RT_FALSE;
}

rt_bool_t lcd_blit_indexed8(const void *pixels,
                            uint32_t width, uint32_t height,
                            uint32_t src_stride,
                            const uint32_t *clut,
                            uint32_t x, uint32_t y,
                            uint32_t dst_width, uint32_t dst_height,
                            rt_bool_t present)
{
    const uint8_t *src_pixels = (const uint8_t *)pixels;
    vg_lite_buffer_t src;
    vg_lite_buffer_t dst;
    vg_lite_matrix_t matrix;
    vg_lite_error_t status;
    uint32_t row;

    if ((src_pixels == RT_NULL) || (clut == RT_NULL) ||
        (width != LCD_INDEXED_WIDTH) ||
        (height != LCD_INDEXED_HEIGHT) ||
        (src_stride < LCD_INDEXED_STRIDE) ||
        (dst_width == 0U) || (dst_height == 0U) ||
        (x >= LCD_LOGICAL_WIDTH) || (y >= LCD_LOGICAL_HEIGHT) ||
        (dst_width > (LCD_LOGICAL_WIDTH - x)) ||
        (dst_height > (LCD_LOGICAL_HEIGHT - y)))
    {
        return RT_FALSE;
    }

    if (src_stride == LCD_INDEXED_STRIDE)
    {
        memcpy(graphics_indexed_storage, src_pixels,
               LCD_INDEXED_BUFFER_SIZE);
    }
    else
    {
        for (row = 0U; row < LCD_INDEXED_HEIGHT; ++row)
        {
            memcpy(&graphics_indexed_storage[row * LCD_INDEXED_STRIDE],
                   &src_pixels[row * src_stride], LCD_INDEXED_STRIDE);
        }
    }

    if (lcd_vglite_init_once() != RT_EOK)
    {
        return RT_FALSE;
    }

    memset(&src, 0, sizeof(src));
    src.width = LCD_INDEXED_WIDTH;
    src.height = LCD_INDEXED_HEIGHT;
    src.stride = LCD_INDEXED_STRIDE;
    src.format = VG_LITE_INDEX_8;
    src.tiled = VG_LITE_LINEAR;
    src.image_mode = VG_LITE_NORMAL_IMAGE_MODE;
    src.transparency_mode = VG_LITE_IMAGE_OPAQUE;
    src.memory = graphics_indexed_storage;
    src.address = (uint32_t)(uintptr_t)graphics_indexed_storage;

    lcd_vglite_buffer_init(&dst, lcd_render_framebuffer(),
                           LCD_LOGICAL_WIDTH, LCD_LOGICAL_HEIGHT,
                           LCD_RENDER_STRIDE);

    status = vg_lite_identity(&matrix);
    if (status == VG_LITE_SUCCESS)
    {
        status = vg_lite_translate((vg_lite_float_t)x,
                                   (vg_lite_float_t)y, &matrix);
    }
    if (status == VG_LITE_SUCCESS)
    {
        status = vg_lite_scale((vg_lite_float_t)dst_width /
                               (vg_lite_float_t)LCD_INDEXED_WIDTH,
                               (vg_lite_float_t)dst_height /
                               (vg_lite_float_t)LCD_INDEXED_HEIGHT,
                               &matrix);
    }
    if (status != VG_LITE_SUCCESS)
    {
        return lcd_indexed_vglite_failed("matrix", status);
    }

    status = vg_lite_set_CLUT(256U,
                              (vg_lite_uint32_t *)(uintptr_t)clut);
    if (status != VG_LITE_SUCCESS)
    {
        return lcd_indexed_vglite_failed("CLUT", status);
    }

    status = vg_lite_blit(&dst, &src, &matrix, VG_LITE_BLEND_NONE,
                          0U, VG_LITE_FILTER_POINT);
    if (status != VG_LITE_SUCCESS)
    {
        return lcd_indexed_vglite_failed("blit", status);
    }

    status = vg_lite_finish();
    if (status != VG_LITE_SUCCESS)
    {
        return lcd_indexed_vglite_failed("finish", status);
    }

    if (present)
    {
        lcd_present_framebuffer();
    }
    return RT_TRUE;
}
#endif

