Rbb666/sdk-bsp-psoc_e84-edgi-talk/libraries/HAL_Drivers/drv_lcd.c
struct drv_lcd_device
{
    struct rt_device parent;

    struct rt_device_graphic_info lcd_info;

    struct rt_semaphore lcd_lock;

    /* 0:front_buf is being used 1: back_buf is being used*/
    rt_uint8_t cur_buf;
    rt_uint8_t *front_buf;
    rt_uint8_t *back_buf;
};

static void lcd_wait_present_done(void)
{
    (void)rt_sem_take(&_lcd.lcd_lock, RT_TICK_PER_SECOND / 20);
}

rt_err_t lcd_wait_frame_done(uint32_t timeout_ms)
{
    return rt_sem_take(&_lcd.lcd_lock, rt_tick_from_millisecond(timeout_ms));
}

#ifdef RT_USING_PWM
static struct rt_device_pwm *g_lcd_bl_pwm = RT_NULL;
static rt_err_t lcd_backlight_set(rt_uint8_t percent)
{
    rt_uint32_t pulse;

    if (percent > 100U)
    {
        percent = 100U;
    }

    if (g_lcd_bl_pwm == RT_NULL)
    {
        g_lcd_bl_pwm = (struct rt_device_pwm *)rt_device_find(LCD_BL_PWM_DEV_NAME);
        if (g_lcd_bl_pwm == RT_NULL)
        {
            LOG_W("Cannot find %s device", LCD_BL_PWM_DEV_NAME);
            return -RT_ENOSYS;
        }

        rt_pwm_enable(g_lcd_bl_pwm, LCD_BL_PWM_CHANNEL);
    }

    pulse = (LCD_BL_PWM_PERIOD_NS * percent) / 100U;
    rt_pwm_set(g_lcd_bl_pwm, LCD_BL_PWM_CHANNEL, LCD_BL_PWM_PERIOD_NS, pulse);
    return RT_EOK;
}
#endif

static rt_err_t drv_lcd_init(struct rt_device *device)
{
    (void)device;
    return RT_EOK;
}

static rt_err_t drv_lcd_control(struct rt_device *device, int cmd, void *args)
{
    struct drv_lcd_device *lcd = LCD_DEVICE(device);
    volatile cy_en_gfx_status_t status;
    switch (cmd)
    {
    case RTGRAPHIC_CTRL_RECT_UPDATE:
    {
        struct rt_device_rect_info *info = (struct rt_device_rect_info *)args;
        uint32_t start_line = 0U;
        uint32_t end_line = lcd->lcd_info.height;
        rt_bool_t try_partial = RT_FALSE;

        if (info != RT_NULL)
        {
            if ((info->width == 0U) || (info->height == 0U))
            {
                return RT_EOK;
            }
            if ((info->x >= lcd->lcd_info.width) || (info->y >= lcd->lcd_info.height))
            {
                return RT_EOK;
            }
            if ((info->x + info->width) > lcd->lcd_info.width)
            {
                info->width = lcd->lcd_info.width - info->x;
            }
            if ((info->y + info->height) > lcd->lcd_info.height)
            {
                info->height = lcd->lcd_info.height - info->y;
            }

            start_line = info->y;
            end_line = info->y + info->height;
            if ((info->x == 0U) && (info->width == lcd->lcd_info.width))
            {
                try_partial = RT_TRUE;
            }
        }

        if (try_partial &&
            ((lcd_gfx_context.dc_context.display_type == GFX_DISP_TYPE_DBI_A) ||
             (lcd_gfx_context.dc_context.display_type == GFX_DISP_TYPE_DBI_B) ||
             (lcd_gfx_context.dc_context.display_type == GFX_DISP_TYPE_DBI_C) ||
             (lcd_gfx_context.dc_context.display_type == GFX_DISP_TYPE_DSI_DBI)))
        {
            status = Cy_GFXSS_TransferPartialFrame(gfxbase, start_line, end_line, &lcd_gfx_context);
            if (CY_GFX_SUCCESS != status)
            {
                LOG_E("[%s: %d] Partial frame transfer failed. Error type: %u\r\n", __func__, __LINE__, status);
                CY_ASSERT(0);
            }
            break;
        }

        lcd_present_framebuffer();
    }
    break;

    case RTGRAPHIC_CTRL_GET_INFO:
    {
        struct rt_device_graphic_info *info = (struct rt_device_graphic_info *)args;

        RT_ASSERT(info != RT_NULL);
        info->pixel_format  = lcd->lcd_info.pixel_format;
        info->bits_per_pixel = 16;
        info->pitch         = lcd->lcd_info.pitch;
        info->width         = lcd->lcd_info.width;
        info->height        = lcd->lcd_info.height;
        info->framebuffer   = lcd->lcd_info.framebuffer;
        info->smem_len      = lcd->lcd_info.smem_len;
    }
    break;
    }

    return RT_EOK;
}

cy_stc_sysint_t dc_irq_cfg =
{
    .intrSrc = GFXSS_DC_IRQ,
    .intrPriority = 3U //DC_INT_PRIORITY
};
cy_stc_sysint_t gpu_irq_cfg =
{
    .intrSrc      = GFXSS_GPU_IRQ,
    .intrPriority = 3U //GPU_INT_PRIORITY
};

#ifdef PKG_USING_CPU_USAGE
uint32_t calculate_idle_percentage(void)
{
    static rt_bool_t cpu_usage_ready = RT_FALSE;
    uint32_t load;

    if (!cpu_usage_ready)
    {
        cpu_usage_init();
        cpu_usage_ready = RT_TRUE;
    }

    load = cpu_load_average();

    return 100 - load;
}
#endif

static void dc_irq_handler(void)
{
    rt_interrupt_enter();
    Cy_GFXSS_Clear_DC_Interrupt(gfxbase, &lcd_gfx_context);
    rt_sem_release(&_lcd.lcd_lock);
    rt_interrupt_leave();
}

static void gpu_irq_handler(void)
{
    rt_interrupt_enter();
    Cy_GFXSS_Clear_GPU_Interrupt(gfxbase, &lcd_gfx_context);
    vg_lite_IRQHandler();
    rt_interrupt_leave();
}

#if LCD_VGLITE_REQUIRED
static rt_err_t lcd_vglite_init_once(void)
{
    static rt_bool_t vglite_ready = RT_FALSE;
#ifdef BSP_USING_SDLPAL
    static rt_bool_t vglite_failed = RT_FALSE;
#endif
    vg_lite_error_t vglite_status;
    vg_module_parameters_t vg_params;

    if (vglite_ready)
    {
        return RT_EOK;
    }
#ifdef BSP_USING_SDLPAL
    if (vglite_failed)
    {
        return -RT_ERROR;
    }
#endif

#ifdef BSP_USING_SDLPAL
    memset(&vg_params, 0, sizeof(vg_params));
#endif
    vg_params.register_mem_base = (uint32_t)GFXSS_GFXSS_GPU_GCNANO;
    vg_params.gpu_mem_base[VG_PARAMS_POS] = GPU_MEM_BASE;
    vg_params.contiguous_mem_base[VG_PARAMS_POS] = (volatile void *)vglite_heap_base;
    vg_params.contiguous_mem_size[VG_PARAMS_POS] = VGLITE_HEAP_SIZE;
    vg_lite_init_mem(&vg_params);

    vglite_status = vg_lite_init((LCD_LOGICAL_WIDTH) / 4,
                                 (LCD_LOGICAL_HEIGHT) / 4);
    if (vglite_status != VG_LITE_SUCCESS)
    {
#ifdef BSP_USING_SDLPAL
        vglite_failed = RT_TRUE;
#endif
        LOG_E("VG-Lite init failed: %d", vglite_status);
        return -RT_ERROR;
    }

    LOG_I("Allocate GPU memory success\n");
    vglite_ready = RT_TRUE;
    return RT_EOK;
}
#endif

rt_err_t psoc_lcd_init(struct drv_lcd_device *lcd)
{
    /* 10.1" display pin configuration */
    mtb_display_tl043wvv02_pin_config_t tl043wvv02_pin_cfg =
    {
        .reset_port = DISPLAY_RESET_PORT,
        .reset_pin  = DISPLAY_RESET_PIN,
    };

    static cy_en_gfx_status_t gfx_status;
    static cy_en_sysint_status_t status;
    volatile cy_en_mipidsi_status_t mipi_status;

