Rbb666/sdk-bsp-psoc_e84-edgi-talk/libraries/HAL_Drivers/drv_lcd.c
    lcd_apply_runtime_gfxss_config();

    /* Graphics subsystem initialization failed. Stop program execution */
    gfx_status = Cy_GFXSS_Init(gfxbase, &GFXSS_config, &lcd_gfx_context);
    if (CY_GFX_SUCCESS != gfx_status)
    {
        LOG_E("[%s: %d] Gfxss initialization failed. Error type: %u\r\n", __func__, __LINE__, status);
        return -RT_ERROR;
    }

    gfxbase->GFXSS_DC.DCNANO.GCREGFRAMEBUFFERSTRIDE = LCD_STRIDE * (LCD_BITS_PER_PIXEL / 8);
    /* Initialize GFXXs DC interrupt */
    status = Cy_SysInt_Init(&dc_irq_cfg, dc_irq_handler);
    if (CY_SYSINT_SUCCESS != status)
    {
        LOG_E("Error in registering DC interrupt: %d\r\n", status);
        return -RT_ERROR;
    }

    /* Enable interrupt in NVIC. */
    NVIC_EnableIRQ(GFXSS_DC_IRQ);

    status = Cy_SysInt_Init(&gpu_irq_cfg, gpu_irq_handler);
    if (CY_SYSINT_SUCCESS != status)
    {
        LOG_E("Error in registering GPU interrupt: %d\r\n", status);
        CY_ASSERT(0);
    }

    /* Enable GPU interrupt */
    Cy_GFXSS_Enable_GPU_Interrupt(GFXSS);

    /* Enable GFX GPU interrupt in NVIC. */
    NVIC_EnableIRQ(GFXSS_GPU_IRQ);

    mipi_status = mtb_display_tl043wvv02_init_without_display_on(GFXSS_GFXSS_MIPIDSI,
                                                                 &tl043wvv02_pin_cfg);

    /* Display initialization failed. Stop program execution */
    if (CY_MIPIDSI_SUCCESS != mipi_status)
    {
        LOG_E("[%s: %d] Display initialization failed. Error type: %u\r\n", __func__, __LINE__, status);
        return -RT_ERROR;
    }

    memset(lcd_render_framebuffer(), 0x00, LCD_RENDER_BUF_SIZE);
#if LCD_NEEDS_SCANOUT_BUFFER
    memset(lcd_scanout_framebuffer(), 0x00, LCD_SCANOUT_BUF_SIZE);
#endif
    SCB_CleanDCache();
    gfxbase->GFXSS_DC.DCNANO.GCREGFRAMEBUFFERSTRIDE = LCD_STRIDE * (LCD_BITS_PER_PIXEL / 8);
    gfx_status = Cy_GFXSS_Set_FrameBuffer(gfxbase, lcd_scanout_framebuffer(), &lcd_gfx_context);
    if (CY_GFX_SUCCESS != gfx_status)
    {
        LOG_E("[%s: %d] Initial framebuffer bind failed. Error type: %u\r\n", __func__, __LINE__, gfx_status);
        return -RT_ERROR;
    }
    lcd_apply_gfxss_rotation();

    mipi_status = mtb_display_tl043wvv02_display_on(GFXSS_GFXSS_MIPIDSI);
    if (CY_MIPIDSI_SUCCESS != mipi_status)
    {
        LOG_E("[%s: %d] Display ON failed. Error type: %u\r\n", __func__, __LINE__, mipi_status);
        return -RT_ERROR;
    }

    LOG_I("init screen success");
    return RT_EOK;
}

#ifdef RT_USING_DEVICE_OPS
const static struct rt_device_ops lcd_ops =
{
    drv_lcd_init,
    RT_NULL,
    RT_NULL,
    RT_NULL,
    RT_NULL,
    drv_lcd_control
};
#endif

int drv_lcd_hw_init(void)
{
    rt_err_t result = RT_EOK;
    struct rt_device *device = &_lcd.parent;

    /* memset _lcd to zero */
    memset(&_lcd, 0x00, sizeof(_lcd));

    /* init lcd_lock semaphore */
    result = rt_sem_init(&_lcd.lcd_lock, "lcd_lock", 0, RT_IPC_FLAG_FIFO);
    if (result != RT_EOK)
    {
        LOG_E("init semaphore failed!\n");
        result = -RT_ENOMEM;
        goto __exit;
    }

#if LCD_USE_AXIDMAC_AREA_COPY
    lcd_axidmac_lock = rt_mutex_create("lcd_dma", RT_IPC_FLAG_FIFO);
    if (lcd_axidmac_lock == RT_NULL)
    {
        LOG_E("init axidmac mutex failed!\n");
        result = -RT_ENOMEM;
        goto __exit;
    }
#endif

    /* config LCD dev info */
    _lcd.lcd_info.height = LCD_LOGICAL_HEIGHT;
    _lcd.lcd_info.width = LCD_LOGICAL_WIDTH;
    _lcd.lcd_info.bits_per_pixel = LCD_BITS_PER_PIXEL;
    _lcd.lcd_info.pixel_format = LCD_PIXEL_FORMAT;
    _lcd.lcd_info.pitch = LCD_RENDER_STRIDE * (LCD_BITS_PER_PIXEL / 8);
    _lcd.lcd_info.smem_len = LCD_RENDER_BUF_SIZE;

    /* malloc memory for Triple Buffering */
    // _lcd.front_buf=_lcd.lcd_info.framebuffer = rt_malloc_align(LCD_BUF_SIZE, 32);
    _lcd.front_buf = _lcd.lcd_info.framebuffer = (rt_uint8_t *)lcd_render_framebuffer();


    if (_lcd.lcd_info.framebuffer == RT_NULL)
    {
        LOG_E("init frame buffer failed!\n");
        result = -RT_ENOMEM;
        goto __exit;
    }
    /* memset buff to 0xFF */
    memset(_lcd.lcd_info.framebuffer, 0x00, LCD_RENDER_BUF_SIZE);
    device->type    = RT_Device_Class_Graphic;
#ifdef RT_USING_DEVICE_OPS
    device->ops     = &lcd_ops;
#else
    device->init    = drv_lcd_init;
#ifndef ART_PI_TouchGFX_LIB
    device->control = drv_lcd_control;
#endif
#endif

    /* register lcd device */
    rt_device_register(device, "lcd", RT_DEVICE_FLAG_RDWR);
    /* init mipi display */
    if (psoc_lcd_init(&_lcd) != RT_EOK)
    {
        result = -RT_ERROR;
        goto __exit;
    }
#ifdef RT_USING_PWM
    lcd_backlight_set(LCD_BL_DEFAULT_BRIGHTNESS);
#endif
#if defined(BSP_USING_LVGL) || LCD_ROTATION_BACKEND_VGLITE
    if (lcd_vglite_init_once() != RT_EOK)
    {
        result = -RT_ERROR;
        goto __exit;
    }
#endif
__exit:
    if (result != RT_EOK)
    {
#if LCD_USE_AXIDMAC_AREA_COPY
        if (lcd_axidmac_lock != RT_NULL)
        {
            rt_mutex_delete(lcd_axidmac_lock);
            lcd_axidmac_lock = RT_NULL;
        }
#endif
        rt_sem_delete(&_lcd.lcd_lock);
    }
    if (result == RT_EOK)
    {
        _lcd.parent.control(&_lcd.parent, RTGRAPHIC_CTRL_RECT_UPDATE, RT_NULL);
    }

    return result;
}
INIT_APP_EXPORT(drv_lcd_hw_init);


#ifdef DRV_DEBUG
#ifdef FINSH_USING_MSH
int lcd_test(void)
{
    struct drv_lcd_device *lcd;
    lcd = (struct drv_lcd_device *)rt_device_find("lcd");

    //while (1)
    {
        if (lcd->lcd_info.pixel_format == RTGRAPHIC_PIXEL_FORMAT_RGB565)
        {
            /* red */
            for (int i = 0; i < lcd->lcd_info.smem_len / 2; i++)
            {
                lcd->lcd_info.framebuffer[2 * i] = 0x00;
                lcd->lcd_info.framebuffer[2 * i + 1] = 0xF8;
            }
            lcd->parent.control(&lcd->parent, RTGRAPHIC_CTRL_RECT_UPDATE, RT_NULL);
            rt_thread_mdelay(1000);
            /* green */
            for (int i = 0; i < lcd->lcd_info.smem_len / 2; i++)
            {
                lcd->lcd_info.framebuffer[2 * i] = 0xE0;
                lcd->lcd_info.framebuffer[2 * i + 1] = 0x07;
            }
            lcd->parent.control(&lcd->parent, RTGRAPHIC_CTRL_RECT_UPDATE, RT_NULL);
            rt_thread_mdelay(1000);
            /* blue */
            for (int i = 0; i < lcd->lcd_info.smem_len / 2; i++)
            {
                lcd->lcd_info.framebuffer[2 * i] = 0x1F;
                lcd->lcd_info.framebuffer[2 * i + 1] = 0x00;
            }
            rt_thread_mdelay(1000);
            for (int i = 0; i < lcd->lcd_info.smem_len / 2; i++)
            {
                lcd->lcd_info.framebuffer[2 * i] = 0xFF;
                lcd->lcd_info.framebuffer[2 * i + 1] = 0xFF;
            }
        }
        else if (lcd->lcd_info.pixel_format == RTGRAPHIC_PIXEL_FORMAT_RGB888)
        {
            /* red */
            for (int i = 0; i < lcd->lcd_info.smem_len / 3; i++)
            {
                lcd->lcd_info.framebuffer[3 * i] = 0x00;
                lcd->lcd_info.framebuffer[3 * i + 1] = 0x00;
                lcd->lcd_info.framebuffer[3 * i + 2] = 0xff;
            }
            lcd->parent.control(&lcd->parent, RTGRAPHIC_CTRL_RECT_UPDATE, RT_NULL);
            rt_thread_mdelay(1000);
            /* green */
            for (int i = 0; i < lcd->lcd_info.smem_len / 3; i++)
            {
                lcd->lcd_info.framebuffer[3 * i] = 0x00;
                lcd->lcd_info.framebuffer[3 * i + 1] = 0xff;
                lcd->lcd_info.framebuffer[3 * i + 2] = 0x00;
            }
            lcd->parent.control(&lcd->parent, RTGRAPHIC_CTRL_RECT_UPDATE, RT_NULL);
            rt_thread_mdelay(1000);
            /* blue */
            for (int i = 0; i < lcd->lcd_info.smem_len / 3; i++)
            {
                lcd->lcd_info.framebuffer[3 * i] = 0xff;
                lcd->lcd_info.framebuffer[3 * i + 1] = 0x00;
                lcd->lcd_info.framebuffer[3 * i + 2] = 0x00;
            }
        }
        rt_thread_mdelay(1000);
    }
    return 0;
}
MSH_CMD_EXPORT(lcd_test, lcd_test);
#endif /* FINSH_USING_MSH */
#endif /* DRV_DEBUG */
#endif
